perf/results/intensivo/node_1/node_intensivo_1.log

> perf@1.0.0 artillery /Users/mmariotti/Documents/UBA/1c20-tp-1/perf
> artillery "run" "intensivo.yaml" "-e" "node"

Started phase 0 (Warm Up), duration: 30s @ 14:59:11(-0300) 2020-05-17
Report @ 14:59:21(-0300) 2020-05-17
Elapsed time: 10 seconds
  Scenarios launched:  49
  Scenarios completed: 19
  Requests completed:  19
  Mean response/sec: 5.02
  Response time (msec):
    min: 514.5
    max: 5958.4
    median: 3258.5
    p95: 5823.4
    p99: 5958.4
  Codes:
    200: 19

Report @ 14:59:31(-0300) 2020-05-17
Elapsed time: 20 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5.01
  Response time (msec):
    min: 6258.6
    max: 11963.6
    median: 9109.7
    p95: 11813.5
    p99: 11963.6
  Codes:
    200: 20

Report @ 14:59:41(-0300) 2020-05-17
Elapsed time: 30 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5.01
  Response time (msec):
    min: 12263.5
    max: 17982.6
    median: 15111.1
    p95: 17832.6
    p99: 17982.6
  Codes:
    200: 20

Started phase 1 (Linear Ramp), duration: 80s @ 14:59:41(-0300) 2020-05-17
Report @ 14:59:51(-0300) 2020-05-17
Elapsed time: 40 seconds
  Scenarios launched:  71
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 7.11
  Response time (msec):
    min: 18277.2
    max: 23976.9
    median: 21127.7
    p95: 23827
    p99: 23976.9
  Codes:
    200: 20

Report @ 15:00:01(-0300) 2020-05-17
Elapsed time: 50 seconds
  Scenarios launched:  127
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 12.71
  Response time (msec):
    min: 24277.3
    max: 29977.7
    median: 27128.1
    p95: 29827.8
    p99: 29977.7
  Codes:
    200: 20

Report @ 15:00:11(-0300) 2020-05-17
Elapsed time: 1 minute, 0 seconds
  Scenarios launched:  179
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 17.97
  Response time (msec):
    min: 30277
    max: 35979.5
    median: 33129.1
    p95: 35829.4
    p99: 35979.5
  Codes:
    200: 20

Report @ 15:00:21(-0300) 2020-05-17
Elapsed time: 1 minute, 10 seconds
  Scenarios launched:  243
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 24.4
  Response time (msec):
    min: 36277.9
    max: 42003.3
    median: 39128
    p95: 41852.7
    p99: 42003.3
  Codes:
    200: 20
  Errors:
    ECONNRESET: 119

Report @ 15:00:31(-0300) 2020-05-17
Elapsed time: 1 minute, 20 seconds
  Scenarios launched:  310
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 31
  Response time (msec):
    min: 42303.4
    max: 47603
    median: 45154.2
    p95: 47522.7
    p99: 47603
  Codes:
    200: 20
  Errors:
    ECONNRESET: 290

Report @ 15:00:41(-0300) 2020-05-17
Elapsed time: 1 minute, 30 seconds
  Scenarios launched:  363
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 36.34
  Response time (msec):
    min: 47963.7
    max: 54367.9
    median: 50787
    p95: 54147.9
    p99: 54367.9
  Codes:
    200: 20
  Errors:
    ECONNRESET: 343

Report @ 15:00:51(-0300) 2020-05-17
Elapsed time: 1 minute, 40 seconds
  Scenarios launched:  423
  Scenarios completed: 41
  Requests completed:  41
  Mean response/sec: 42.3
  Response time (msec):
    min: 54748.4
    max: 60006.1
    median: 60003.8
    p95: 60005.4
    p99: 60006.1
  Codes:
    200: 13
    504: 28
  Errors:
    ECONNRESET: 382

Report @ 15:01:01(-0300) 2020-05-17
Elapsed time: 1 minute, 50 seconds
  Scenarios launched:  477
  Scenarios completed: 127
  Requests completed:  127
  Mean response/sec: 47.7
  Response time (msec):
    min: 60002.9
    max: 60009.3
    median: 60004.1
    p95: 60005.3
    p99: 60006.9
  Codes:
    504: 127
  Errors:
    ECONNRESET: 350

Started phase 2 (High Plain), duration: 30s @ 15:01:01(-0300) 2020-05-17
Report @ 15:01:11(-0300) 2020-05-17
Elapsed time: 2 minutes, 0 seconds
  Scenarios launched:  499
  Scenarios completed: 126
  Requests completed:  126
  Mean response/sec: 49.95
  Response time (msec):
    min: 60002.8
    max: 60012.5
    median: 60004.1
    p95: 60005.2
    p99: 60007.7
  Codes:
    504: 126
  Errors:
    ECONNRESET: 373

Warning: 
CPU usage of Artillery seems to be very high (pids: 40250)
which may severely affect its performance.
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Report @ 15:01:21(-0300) 2020-05-17
Elapsed time: 2 minutes, 10 seconds
  Scenarios launched:  500
  Scenarios completed: 177
  Requests completed:  177
  Mean response/sec: 50
  Response time (msec):
    min: 60003.1
    max: 75656.1
    median: 67103.7
    p95: 75560.4
    p99: 75642.6
  Codes:
    504: 177
  Errors:
    ECONNRESET: 323

Report @ 15:01:31(-0300) 2020-05-17
Elapsed time: 2 minutes, 20 seconds
  Scenarios launched:  500
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 50
  Response time (msec):
    min: 60003.1
    max: 60005.6
    median: 60004.2
    p95: 60005.6
    p99: 60005.6
  Codes:
    504: 20
  Errors:
    ECONNRESET: 480

Warning: High CPU usage warning (pids: 40250).
See https://artillery.io/docs/faq/#high-cpu-warnings for details.

Started phase 3 (Pause), duration: undefineds @ 15:01:31(-0300) 2020-05-17
Report @ 15:01:41(-0300) 2020-05-17
Elapsed time: 2 minutes, 30 seconds
  Scenarios launched:  3
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.3
  Response time (msec):
    min: 60002.6
    max: 60006
    median: 60004.2
    p95: 60005.5
    p99: 60006
  Codes:
    504: 20
  Errors:
    ECONNRESET: 3

Report @ 15:01:51(-0300) 2020-05-17
Elapsed time: 2 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 41
  Requests completed:  41
  Mean response/sec: NaN
  Response time (msec):
    min: 60003.3
    max: 60098.2
    median: 60004.5
    p95: 60005.5
    p99: 60098.2
  Codes:
    504: 41

Report @ 15:02:01(-0300) 2020-05-17
Elapsed time: 2 minutes, 50 seconds
  Scenarios launched:  0
  Scenarios completed: 102
  Requests completed:  102
  Mean response/sec: NaN
  Response time (msec):
    min: 60003
    max: 60008.2
    median: 60004.4
    p95: 60006.4
    p99: 60007.7
  Codes:
    504: 102

Report @ 15:02:11(-0300) 2020-05-17
Elapsed time: 3 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 97
  Requests completed:  97
  Mean response/sec: NaN
  Response time (msec):
    min: 60003.4
    max: 60007.8
    median: 60004.8
    p95: 60007
    p99: 60007.8
  Codes:
    504: 97

Report @ 15:02:21(-0300) 2020-05-17
Elapsed time: 3 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 107
  Requests completed:  107
  Mean response/sec: NaN
  Response time (msec):
    min: 60001.9
    max: 60008.3
    median: 60003.3
    p95: 60004.6
    p99: 60006.8
  Codes:
    504: 107

Report @ 15:02:31(-0300) 2020-05-17
Elapsed time: 3 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 144
  Requests completed:  144
  Mean response/sec: NaN
  Response time (msec):
    min: 60003.4
    max: 92043.9
    median: 67133.8
    p95: 91898.1
    p99: 92004.1
  Codes:
    504: 144

Started phase 4 (Non-linear Ramp), duration: 120s @ 15:02:31(-0300) 2020-05-17
Report @ 15:02:41(-0300) 2020-05-17
Elapsed time: 3 minutes, 30 seconds
  Scenarios launched:  8
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 0.91
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 15:02:51(-0300) 2020-05-17
Elapsed time: 3 minutes, 40 seconds
  Scenarios launched:  8
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 0.87
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 15:03:01(-0300) 2020-05-17
Elapsed time: 3 minutes, 50 seconds
  Scenarios launched:  8
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 0.84
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 15:03:11(-0300) 2020-05-17
Elapsed time: 4 minutes, 0 seconds
  Scenarios launched:  9
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 0.9
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 15:03:21(-0300) 2020-05-17
Elapsed time: 4 minutes, 10 seconds
  Scenarios launched:  8
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 0.87
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 15:03:31(-0300) 2020-05-17
Elapsed time: 4 minutes, 20 seconds
  Scenarios launched:  8
  Scenarios completed: 0
  Requests completed:  0
  Mean response/sec: 0.84
  Response time (msec):
    min: NaN
    max: NaN
    median: NaN
    p95: NaN
    p99: NaN

Report @ 15:03:41(-0300) 2020-05-17
Elapsed time: 4 minutes, 30 seconds
  Scenarios launched:  9
  Scenarios completed: 14
  Requests completed:  14
  Mean response/sec: 0.9
  Response time (msec):
    min: 53008.1
    max: 60005.2
    median: 57554
    p95: 60005.1
    p99: 60005.2
  Codes:
    200: 11
    504: 3

Report @ 15:03:51(-0300) 2020-05-17
Elapsed time: 4 minutes, 40 seconds
  Scenarios launched:  8
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.87
  Response time (msec):
    min: 39010
    max: 52307.9
    median: 45659.1
    p95: 51958
    p99: 52307.9
  Codes:
    200: 20

Report @ 15:04:01(-0300) 2020-05-17
Elapsed time: 4 minutes, 50 seconds
  Scenarios launched:  8
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.84
  Response time (msec):
    min: 25011.7
    max: 38310
    median: 31659.5
    p95: 37959.7
    p99: 38310
  Codes:
    200: 20

Report @ 15:04:11(-0300) 2020-05-17
Elapsed time: 5 minutes, 0 seconds
  Scenarios launched:  9
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.9
  Response time (msec):
    min: 11015.7
    max: 24311.6
    median: 17663.5
    p95: 23961.7
    p99: 24311.6
  Codes:
    200: 20

Report @ 15:04:21(-0300) 2020-05-17
Elapsed time: 5 minutes, 10 seconds
  Scenarios launched:  8
  Scenarios completed: 17
  Requests completed:  17
  Mean response/sec: 0.87
  Response time (msec):
    min: 504.2
    max: 10326.2
    median: 4729.9
    p95: 10081.4
    p99: 10326.2
  Codes:
    200: 17

Report @ 15:04:31(-0300) 2020-05-17
Elapsed time: 5 minutes, 20 seconds
  Scenarios launched:  8
  Scenarios completed: 8
  Requests completed:  8
  Mean response/sec: 0.83
  Response time (msec):
    min: 503.5
    max: 504.7
    median: 504.3
    p95: 504.7
    p99: 504.7
  Codes:
    200: 8

Started phase 5 (Non-linear Ramp 2), duration: 60s @ 15:04:31(-0300) 2020-05-17
Report @ 15:04:41(-0300) 2020-05-17
Elapsed time: 5 minutes, 30 seconds
  Scenarios launched:  17
  Scenarios completed: 16
  Requests completed:  16
  Mean response/sec: 1.7
  Response time (msec):
    min: 503.4
    max: 505.1
    median: 504.4
    p95: 505
    p99: 505.1
  Codes:
    200: 16

Report @ 15:04:51(-0300) 2020-05-17
Elapsed time: 5 minutes, 40 seconds
  Scenarios launched:  17
  Scenarios completed: 17
  Requests completed:  17
  Mean response/sec: 1.73
  Response time (msec):
    min: 503.3
    max: 507.3
    median: 504.3
    p95: 506.5
    p99: 507.3
  Codes:
    200: 17

Report @ 15:05:01(-0300) 2020-05-17
Elapsed time: 5 minutes, 50 seconds
  Scenarios launched:  16
  Scenarios completed: 17
  Requests completed:  17
  Mean response/sec: 1.67
  Response time (msec):
    min: 503.3
    max: 507.7
    median: 503.8
    p95: 506.7
    p99: 507.7
  Codes:
    200: 17

Report @ 15:05:11(-0300) 2020-05-17
Elapsed time: 6 minutes, 0 seconds
  Scenarios launched:  17
  Scenarios completed: 16
  Requests completed:  16
  Mean response/sec: 1.7
  Response time (msec):
    min: 502.9
    max: 505.4
    median: 503.6
    p95: 505
    p99: 505.4
  Codes:
    200: 16

Report @ 15:05:21(-0300) 2020-05-17
Elapsed time: 6 minutes, 10 seconds
  Scenarios launched:  17
  Scenarios completed: 17
  Requests completed:  17
  Mean response/sec: 1.73
  Response time (msec):
    min: 503.4
    max: 504.7
    median: 503.8
    p95: 504.7
    p99: 504.7
  Codes:
    200: 17

Report @ 15:05:31(-0300) 2020-05-17
Elapsed time: 6 minutes, 20 seconds
  Scenarios launched:  16
  Scenarios completed: 17
  Requests completed:  17
  Mean response/sec: 1.67
  Response time (msec):
    min: 503.2
    max: 507.7
    median: 503.9
    p95: 507.4
    p99: 507.7
  Codes:
    200: 17

Started phase 6 (Active Pause), duration: 30s @ 15:05:31(-0300) 2020-05-17
Report @ 15:05:41(-0300) 2020-05-17
Elapsed time: 6 minutes, 30 seconds
  Scenarios launched:  50
  Scenarios completed: 19
  Requests completed:  19
  Mean response/sec: 5
  Response time (msec):
    min: 506.3
    max: 5909.2
    median: 3208.7
    p95: 5773.9
    p99: 5909.2
  Codes:
    200: 19

Report @ 15:05:51(-0300) 2020-05-17
Elapsed time: 6 minutes, 40 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5
  Response time (msec):
    min: 6208.2
    max: 11911
    median: 9060.3
    p95: 11760.7
    p99: 11911
  Codes:
    200: 20

Report @ 15:06:01(-0300) 2020-05-17
Elapsed time: 6 minutes, 50 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5
  Response time (msec):
    min: 12210.6
    max: 17924.9
    median: 15062.8
    p95: 17774.7
    p99: 17924.9
  Codes:
    200: 20

Started phase 7 (Non-linear Ramp 3), duration: 30s @ 15:06:01(-0300) 2020-05-17
Report @ 15:06:11(-0300) 2020-05-17
Elapsed time: 7 minutes, 0 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5
  Response time (msec):
    min: 18224.6
    max: 23925.9
    median: 21074.5
    p95: 23775.8
    p99: 23925.9
  Codes:
    200: 20

Report @ 15:06:21(-0300) 2020-05-17
Elapsed time: 7 minutes, 10 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5
  Response time (msec):
    min: 24225.1
    max: 29928.6
    median: 27076.7
    p95: 29778.7
    p99: 29928.6
  Codes:
    200: 20

Report @ 15:06:31(-0300) 2020-05-17
Elapsed time: 7 minutes, 20 seconds
  Scenarios launched:  50
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 5
  Response time (msec):
    min: 30228.4
    max: 35928.5
    median: 33078.7
    p95: 35778.7
    p99: 35928.5
  Codes:
    200: 20

Report @ 15:06:41(-0300) 2020-05-17
Elapsed time: 7 minutes, 30 seconds
  Scenarios launched:  1
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: 0.1
  Response time (msec):
    min: 36228.6
    max: 41940.6
    median: 39080.5
    p95: 41790.5
    p99: 41940.6
  Codes:
    200: 20

Report @ 15:06:51(-0300) 2020-05-17
Elapsed time: 7 minutes, 40 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 42240
    max: 47940.3
    median: 45089.9
    p95: 47790.4
    p99: 47940.3
  Codes:
    200: 20

Report @ 15:07:01(-0300) 2020-05-17
Elapsed time: 7 minutes, 50 seconds
  Scenarios launched:  0
  Scenarios completed: 20
  Requests completed:  20
  Mean response/sec: NaN
  Response time (msec):
    min: 48240.9
    max: 53942.2
    median: 51092.4
    p95: 53792.1
    p99: 53942.2
  Codes:
    200: 20

Report @ 15:07:11(-0300) 2020-05-17
Elapsed time: 8 minutes, 0 seconds
  Scenarios launched:  0
  Scenarios completed: 21
  Requests completed:  21
  Mean response/sec: NaN
  Response time (msec):
    min: 54242.9
    max: 60002.3
    median: 57242
    p95: 59969.1
    p99: 60002.3
  Codes:
    200: 20
    504: 1

Report @ 15:07:21(-0300) 2020-05-17
Elapsed time: 8 minutes, 10 seconds
  Scenarios launched:  0
  Scenarios completed: 50
  Requests completed:  50
  Mean response/sec: NaN
  Response time (msec):
    min: 60002.4
    max: 60005.3
    median: 60003.2
    p95: 60004.2
    p99: 60005.3
  Codes:
    504: 50

Report @ 15:07:31(-0300) 2020-05-17
Elapsed time: 8 minutes, 20 seconds
  Scenarios launched:  0
  Scenarios completed: 12
  Requests completed:  12
  Mean response/sec: NaN
  Response time (msec):
    min: 60002.3
    max: 60009.8
    median: 60003.3
    p95: 60009.4
    p99: 60009.8
  Codes:
    504: 12

Report @ 15:07:41(-0300) 2020-05-17
Elapsed time: 8 minutes, 30 seconds
  Scenarios launched:  0
  Scenarios completed: 14
  Requests completed:  14
  Mean response/sec: NaN
  Response time (msec):
    min: 67098.5
    max: 75660.1
    median: 75327
    p95: 75647.5
    p99: 75660.1
  Codes:
    504: 14

Report @ 15:07:46(-0300) 2020-05-17
Elapsed time: 8 minutes, 35 seconds
  Scenarios launched:  0
  Scenarios completed: 25
  Requests completed:  25
  Mean response/sec: NaN
  Response time (msec):
    min: 75156.3
    max: 75644.1
    median: 75404.2
    p95: 75626.3
    p99: 75644.1
  Codes:
    504: 25

All virtual users finished
Summary report @ 15:07:46(-0300) 2020-05-17
  Scenarios launched:  4344
  Scenarios completed: 1681
  Requests completed:  1681
  Mean response/sec: 8.44
  Response time (msec):
    min: 502.9
    max: 92043.9
    median: 60003.7
    p95: 75395.8
    p99: 91692.5
  Scenario counts:
    intensivo: 4344 (100%)
  Codes:
    200: 587
    504: 1094
  Errors:
    ECONNRESET: 2663